{
    "pinwheels": {
        "steps": {
            "1": "Place tortilla on cutting board.",
            "2": "Use a butter knife to scoop nut butter from the jar. Spread nut butter onto tortilla, leaving 1/2-inch uncovered at the edges.",
            "3": "Clean the knife by wiping with a paper towel.",
            "4": "Use the knife to scoop jelly from the jar. Spread jelly over the nut butter.",
            "5": "Clean the knife by wiping with a paper towel.",
            "6": "Roll the tortilla from one end to the other into a log shape, about 1.5 inches thick. Roll it tight enough to prevent gaps, but not so tight that the filling leaks.",
            "7": "Secure the rolled tortilla by inserting 5 toothpicks about 1 inch apart.",
            "8": "Trim the ends of the tortilla roll with the butter knife, leaving 1⁄2 inch margin between the last toothpick and the end of the roll. Discard ends.",
            "9": "Slide floss under the tortilla, perpendicular to the length of the roll. Place the floss halfway between two toothpicks.",
            "10": "Cross the two ends of the floss over the top of the tortilla roll. Holding one end of the floss in each hand, pull the floss ends in opposite directions to slice.",
            "11": "Continue slicing with floss to create 5 pinwheels.",
            "12": "Place the pinwheels on a plate."
        }
    },
    "tea": {
        "steps": {
            "1": "Measure 12 ounces of cold water and transfer to a kettle.",
            "2": "Place tea bag in mug.",
            "3": "Check the temperature of the water.",
            "4": "Pour water into mug.",
            "5": "Steep for 3 minutes.",
            "6": "Discard tea bag.",
            "7": "Add honey and stir."
        }
    },
    "quesadilla": {
        "steps": {
            "1": "Place tortilla on cutting board.",
            "2": "Use a butter knife to spread a layer of Nutella onto tortilla.",
            "3": "Top with banana slices.",
            "4": "Sprinkle small amount of cinnamon onto tortilla.",
            "5": "Fold tortilla in half into semi-circle.",
            "6": "Slice tortilla in half using butter knife to create two triangular wedges.",
            "7": "Place tortilla wedges on a plate to serve."
        }
    },
    "coffee": {
        "steps": {
            "1": "Measure 12 ounces of cold water and transfer to a kettle.",
            "2": "Assemble the filter cone. Place the dripper on top of a coffee mug.",
            "3": "Prepare the filter insert by folding the paper filter in half to create a semi-circle, and in half again to create a quarter-circle. Place the paper filter in the dripper and spread open to create a cone.",
            "4": "Weigh the coffee beans and grind until the coffee grounds are the consistency of coarse sand, about 20 seconds. Transfer the grounds to the filter cone.",
            "5": "Check the temperature of the water.",
            "6": "Pour a small amount of water in the filter to wet the grounds. Wait about 30 seconds.",
            "7": "Slowly pour the rest of the water over the grounds in a circular motion. Do not overfill beyond the top of the paper filter.",
            "8": "Let the coffee drain completely into the mug before removing the dripper. Discard the paper filter and coffee grounds."
        }
    },
    "oatmeal": {
        "steps": {
            "1": "Measure 4 Tablespoons of quick-cook oats and place in a microwave-safe bowl.",
            "2": "Add 1/2 cup water.",
            "3": "Microwave for 30 seconds.",
            "4": "Add handful of raisins and stir.",
            "5": "Microwave for 60 more seconds then stir.",
            "6": "Top with banana slices.",
            "7": "Sprinkle with cinnamon and drizzle with honey before serving."
        }
    }
}